In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

In [8]:
df = sns.load_dataset('titanic')

In [9]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [12]:
df.shape

(891, 15)

In [13]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [15]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [16]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [17]:
df.describe(include=object)

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [20]:
print('Average:',df['age'].mean())
print('Median:',df['age'].median())
print('Standar Deviation:',df['age'].std())
print('Minimum Value:',df['age'].min())
print('Maximum Value:',df['age'].max())

Average: 29.69911764705882
Median: 28.0
Standar Deviation: 14.526497332334042
Minimum Value: 0.42
Maximum Value: 80.0

In [21]:
df['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [22]:
df['embark_town'].nunique()

3

In [23]:
df['embark_town'].value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [31]:
fd = pd.DataFrame({'A':[np.nan,1,np.nan,2,5,7],
'B':[np.nan,np.nan,np.nan,8,7,9],
'C':[3,4,6,np.nan,np.nan,np.nan],
'D':[1,2,3,4,5,6]
})

In [32]:
fd

     A    B    C  D
0  NaN  NaN  3.0  1
1  1.0  NaN  4.0  2
2  NaN  NaN  6.0  3
3  2.0  8.0  NaN  4
4  5.0  7.0  NaN  5
5  7.0  9.0  NaN  6

In [34]:
fd.isna()

       A      B      C      D
0   True   True  False  False
1  False   True  False  False
2   True   True  False  False
3  False  False   True  False
4  False  False   True  False
5  False  False   True  False

In [35]:
df.isna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [36]:
fd.isna().sum()

A    2
B    3
C    3
D    0
dtype: int64

In [37]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [38]:
fd.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [45]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [46]:
df.dropna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [47]:
df.dropna(axis=1)

,survived,pclass,sex,sibsp,parch,fare,class,who,adult_male,alive,alone
0,0,3,male,1,0,7.2500,Third,man,True,no,False
1,1,1,female,1,0,71.2833,First,woman,False,yes,False
2,1,3,female,0,0,7.9250,Third,woman,False,yes,True
3,1,1,female,1,0,53.1000,First,woman,False,yes,False
4,0,3,male,0,0,8.0500,Third,man,True,no,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Second,man,True,no,True
887,1,1,female,0,0,30.0000,First,woman,False,yes,True
888,0,3,female,1,2,23.4500,Third,woman,False,no,False
889,1,1,male,0,0,30.0000,First,man,True,yes,True
890,0,3,male,0,0,7.7500,Third,man,True,no,True

In [49]:
df.dropna(thresh=2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [53]:
fd

     A    B    C  D
0  NaN  NaN  3.0  1
1  1.0  NaN  4.0  2
2  NaN  NaN  6.0  3
3  2.0  8.0  NaN  4
4  5.0  7.0  NaN  5
5  7.0  9.0  NaN  6

In [60]:
fd.dropna(thresh=3)

     A    B    C  D
1  1.0  NaN  4.0  2
3  2.0  8.0  NaN  4
4  5.0  7.0  NaN  5
5  7.0  9.0  NaN  6

In [63]:
fd.fillna(value='X')

     A    B    C  D
0    X    X  3.0  1
1  1.0    X  4.0  2
2    X    X  6.0  3
3  2.0  8.0    X  4
4  5.0  7.0    X  5
5  7.0  9.0    X  6

In [72]:
fd['B'].fillna(value=fd['B'].mean())

0    8.0
1    8.0
2    8.0
3    8.0
4    7.0
5    9.0
Name: B, dtype: float64

In [73]:
fd['A'].fillna(value=fd['A'].mean())

0    3.75
1    1.00
2    3.75
3    2.00
4    5.00
5    7.00
Name: A, dtype: float64

In [74]:
fd

     A    B    C  D
0  NaN  NaN  3.0  1
1  1.0  NaN  4.0  2
2  NaN  NaN  6.0  3
3  2.0  8.0  NaN  4
4  5.0  7.0  NaN  5
5  7.0  9.0  NaN  6

In [81]:
data = {'University':['ui','ui','binus','binus','binus','prasmul'],
'Name':['A','B','C','D','E','F'],
'Biaya':[100,400,200,175,123,352],
'Gender':['male','male','female','female','female','female']}

In [82]:
aa = pd.DataFrame(data)

In [83]:
aa

  University Name  Biaya  Gender
0         ui    A    100    male
1         ui    B    400    male
2      binus    C    200  female
3      binus    D    175  female
4      binus    E    123  female
5    prasmul    F    352  female

In [86]:
aa.groupby('Gender')

In [88]:
aa.groupby('Gender').mean()

        Biaya
Gender
female  212.5
male    250.0

In [89]:
aa.groupby('Gender').std()

             Biaya
Gender
female   98.375132
male    212.132034

In [90]:
aa.groupby('Gender').min()

       University Name  Biaya
Gender
female      binus    C    123
male           ui    A    100

In [91]:
aa.groupby('Gender').max()

       University Name  Biaya
Gender
female    prasmul    F    352
male           ui    B    400

In [92]:
aa.groupby('Gender').count()

        University  Name  Biaya
Gender
female           4     4      4
male             2     2      2

In [93]:
aa.groupby('Gender').describe()

       Biaya
       count   mean         std    min    25%    50%    75%    max
Gender
female   4.0  212.5   98.375132  123.0  162.0  187.5  238.0  352.0
male     2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0

In [94]:
aa.groupby('Gender').describe().transpose()

Gender           female        male
Biaya count    4.000000    2.000000
      mean   212.500000  250.000000
      std     98.375132  212.132034
      min    123.000000  100.000000
      25%    162.000000  175.000000
      50%    187.500000  250.000000
      75%    238.000000  325.000000
      max    352.000000  400.000000

In [98]:
aa.groupby('Gender').describe().transpose()['female']

Biaya  count      4.000000
       mean     212.500000
       std       98.375132
       min      123.000000
       25%      162.000000
       50%      187.500000
       75%      238.000000
       max      352.000000
Name: female, dtype: float64

In [99]:
aa.groupby('Gender').describe().transpose()['female'].loc['Biaya'].loc['25%']

162.0